StressTest/GetTest.yml
config:
  target: 'http://localhost:80'
  http:
    pool: 10
  phases:
    - duration: 60
      arrivalRate: 6000
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: 'GET all products'
    flow:
      - get:
          url: '/product/{{$randomNumber(2, 20000000)}}'