StressTest/PostTest.yml
config:
  target: 'http://localhost:3000'
  http:
    pool: 10
  phases:
    - duration: 60
      arrivalRate: 100
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: 'Post a product in cart'
    flow:
      - post:
          url: '/api/cart/5/{{$randomNumber(2, 10000000)}}'
          cart: 5